# ExtrusionLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ExtrusionLength Property
ParameterTypeId Class See Also
---
"Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ExtrusionLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtrusionLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ExtrusionLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace